---
type: WireConduitTypeSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# WireConduitTypeSet

`Autodesk.Revit.DB.Electrical.WireConduitTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WireConduitTypeSet | — | `public WireConduitTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( WireConduitType item )` |
| Method | Erase | — | `public virtual int Erase ( WireConduitType item )` |
| Method | ForwardIterator | — | `public virtual WireConduitTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( WireConduitType item )` |
| Method | ReverseIterator | — | `public virtual WireConduitTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |